# FbxAssetType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxAssetType Property
ParameterTypeId Class See Also
---
"Light Source"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxAssetType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxAssetType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxAssetType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace